[
  {
    "name": "Incline Hammer Curls",
    "type": "strength",
    "muscle": "biceps",
    "equipment": "dumbbell",
    "difficulty": "beginner",
    "instructions": "Seat yourself on an incline bench with a dumbbell in each hand. You should pressed firmly against he back with your feet together. Allow the dumbbells to hang straight down at your side, holding them with a neutral grip. This will be your starting position. Initiate the movement by flexing at the elbow, attempting to keep the upper arm stationary. Continue to the top of the movement and pause, then slowly return to the start position."
  },
  {
    "name": "Wide-grip barbell curl",
    "type": "strength",
    "muscle": "biceps",
    "equipment": "barbell",
    "difficulty": "beginner",
    "instructions": "Stand up with your torso upright while holding a barbell at the wide outer handle. The palm of your hands should be facing forward. The elbows should be close to the torso. This will be your starting position. While holding the upper arms stationary, curl the weights forward while contracting the biceps as you breathe out. Tip: Only the forearms should move. Continue the movement until your biceps are fully contracted and the bar is at shoulder level. Hold the contracted position for a second and squeeze the biceps hard. Slowly begin to bring the bar back to starting position as your breathe in. Repeat for the recommended amount of repetitions.  Variations:  You can also perform this movement using an E-Z bar or E-Z attachment hooked to a low pulley. This variation seems to really provide a good contraction at the top of the movement. You may also use the closer grip for variety purposes."
  },
  {
    "name": "EZ-bar spider curl",
    "type": "strength",
    "muscle": "biceps",
    "equipment": "barbell",
    "difficulty": "intermediate",
    "instructions": "Start out by setting the bar on the part of the preacher bench that you would normally sit on. Make sure to align the barbell properly so that it is balanced and will not fall off. Move to the front side of the preacher bench (the part where the arms usually lay) and position yourself to lay at a 45 degree slant with your torso and stomach pressed against the front side of the preacher bench. Make sure that your feet (especially the toes) are well positioned on the floor and place your upper arms on top of the pad located on the inside part of the preacher bench. Use your arms to grab the barbell with a supinated grip (palms facing up) at about shoulder width apart or slightly closer from each other. Slowly begin to lift the barbell upwards and exhale. Hold the contracted position for a second as you squeeze the biceps. Slowly begin to bring the barbell back to the starting position as your breathe in. . Repeat for the recommended amount of repetitions.  Variation: You can also use dumbbells when performing this exercise. Just make sure you place the dumbbells on the part of the preacher bench where you would normally sit properly."
  },
  {
    "name": "Hammer Curls",
    "type": "strength",
    "muscle": "biceps",
    "equipment": "dumbbell",
    "difficulty": "intermediate",
    "instructions": "Stand up with your torso upright and a dumbbell on each hand being held at arms length. The elbows should be close to the torso. The palms of the hands should be facing your torso. This will be your starting position. Now, while holding your upper arm stationary, exhale and curl the weight forward while contracting the biceps. Continue to raise the weight until the biceps are fully contracted and the dumbbell is at shoulder level. Hold the contracted position for a brief moment as you squeeze the biceps. Tip: Focus on keeping the elbow stationary and only moving your forearm. After the brief pause, inhale and slowly begin the lower the dumbbells back down to the starting position. Repeat for the recommended amount of repetitions.  Variations: There are many possible variations for this movement. For instance, you can perform the exercise sitting down on a bench with or without back support and you can also perform it by alternating arms; first lift the right arm for one repetition, then the left, then the right, etc."
  },
  {
    "name": "EZ-Bar Curl",
    "type": "strength",
    "muscle": "biceps",
    "equipment": "e-z_curl_bar",
    "difficulty": "intermediate",
    "instructions": "Stand up straight while holding an EZ curl bar at the wide outer handle. The palms of your hands should be facing forward and slightly tilted inward due to the shape of the bar. Keep your elbows close to your torso. This will be your starting position. Now, while keeping your upper arms stationary, exhale and curl the weights forward while contracting the biceps. Focus on only moving your forearms. Continue to raise the weight until your biceps are fully contracted and the bar is at shoulder level. Hold the top contracted position for a moment and squeeze the biceps. Then inhale and slowly lower the bar back to the starting position. Repeat for the recommended amount of repetitions.  Variations: You can also perform this movement using an E-Z attachment hooked to a low pulley. This variation seems to really provide a good contraction at the top of the movement. You may also use the closer grip for variety purposes."
  },
  {
    "name": "Zottman Curl",
    "type": "strength",
    "muscle": "biceps",
    "equipment": "None",
    "difficulty": "intermediate",
    "instructions": "Stand up with your torso upright and a dumbbell in each hand being held at arms length. The elbows should be close to the torso. Make sure the palms of the hands are facing each other. This will be your starting position. While holding the upper arm stationary, curl the weights while contracting the biceps as you breathe out. Only the forearms should move. Your wrist should rotate so that you have a supinated (palms up) grip. Continue the movement until your biceps are fully contracted and the dumbbells are at shoulder level. Hold the contracted position for a second as you squeeze the biceps. Now during the contracted position, rotate your wrist until you now have a pronated (palms facing down) grip with the thumb at a higher position than the pinky. Slowly begin to bring the dumbbells back down using the pronated grip. As the dumbbells close your thighs, start rotating the wrist so that you go back to a neutral (palms facing your body) grip. Repeat for the recommended amount of repetitions."
  },
  {
    "name": "Biceps curl to shoulder press",
    "type": "strength",
    "muscle": "biceps",
    "equipment": "dumbbell",
    "difficulty": "beginner",
    "instructions": "Begin in a standing position with a dumbbell in each hand. Your arms should be hanging at your sides with your palms facing forward. Look directly ahead, keeping your chest up, with your feet shoulder-width apart. This will be your starting position. Initiate the movement by flexing the elbows to curl the weight. Do not use momentum or flex through the shoulder, instead use a controlled motion. Execute the pressing movement by extending the arm, flexing and abducting the shoulder to rotate the arm as you press above your head. Pause at the top of the motion before reversing the movement to return to the starting position. Complete the desired number of repetitions before switching to the opposite side."
  },
  {
    "name": "Barbell Curl",
    "type": "strength",
    "muscle": "biceps",
    "equipment": "barbell",
    "difficulty": "intermediate",
    "instructions": "Stand up with your torso upright while holding a barbell at a shoulder-width grip. The palm of your hands should be facing forward and the elbows should be close to the torso. This will be your starting position. While holding the upper arms stationary, curl the weights forward while contracting the biceps as you breathe out. Tip: Only the forearms should move. Continue the movement until your biceps are fully contracted and the bar is at shoulder level. Hold the contracted position for a second and squeeze the biceps hard. Slowly begin to bring the bar back to starting position as your breathe in. Repeat for the recommended amount of repetitions.  Variations:  You can also perform this movement using a straight bar attachment hooked to a low pulley. This variation seems to really provide a good contraction at the top of the movement. You may also use the closer grip for variety purposes."
  },
  {
    "name": "Concentration curl",
    "type": "strength",
    "muscle": "biceps",
    "equipment": "dumbbell",
    "difficulty": "intermediate",
    "instructions": "Sit down on a flat bench with one dumbbell in front of you between your legs. Your legs should be spread with your knees bent and feet on the floor. Use your right arm to pick the dumbbell up. Place the back of your right upper arm on the top of your inner right thigh. Rotate the palm of your hand until it is facing forward away from your thigh. Tip: Your arm should be extended and the dumbbell should be above the floor. This will be your starting position. While holding the upper arm stationary, curl the weights forward while contracting the biceps as you breathe out. Only the forearms should move. Continue the movement until your biceps are fully contracted and the dumbbells are at shoulder level. Tip: At the top of the movement make sure that the little finger of your arm is higher than your thumb. This guarantees a good contraction. Hold the contracted position for a second as you squeeze the biceps. Slowly begin to bring the dumbbells back to starting position as your breathe in. Caution: Avoid swinging motions at any time. Repeat for the recommended amount of repetitions. Then repeat the movement with the left arm.  Variations: This exercise can be performed standing with the torso bent forward and the arm in front of you. In this case, no leg support is used for the back of your arm so you will need to make extra effort to ensure no movement of the upper arm. This is a more challenging version of the exercise and is not recommended for people with lower back issues."
  },
  {
    "name": "Flexor Incline Dumbbell Curls",
    "type": "strength",
    "muscle": "biceps",
    "equipment": "dumbbell",
    "difficulty": "beginner",
    "instructions": "Hold the dumbbell towards the side farther from you so that you have more weight on the side closest to you. (This can be done for a good effect on all bicep dumbbell exercises). Now do a normal incline dumbbell curl, but keep your wrists as far back as possible so as to neutralize any stress that is placed on them. Sit on an incline bench that is angled at 45-degrees while holding a dumbbell on each hand. Let your arms hang down on your sides, with the elbows in, and turn the palms of your hands forward with the thumbs pointing away from the body. Tip: You will keep this hand position throughout the movement as there should not be any twisting of the hands as they come up. This will be your starting position. Curl up the two dumbbells at the same time until your biceps are fully contracted and exhale. Tip: Do not swing the arms or use momentum. Keep a controlled motion at all times. Hold the contracted position for a second at the top. As you inhale, slowly go back to the starting position. Repeat for the recommended amount of repetitions.  Caution: Do not extend your arms totally as you could injure your elbows if you hyperextend them. Also, make sure that on the way down you move slowly to avoid injury. Variations: You can use cables for this movement as well."
  },
  {
    "name": "Preacher Curl",
    "type": "strength",
    "muscle": "biceps",
    "equipment": "dumbbell",
    "difficulty": "intermediate",
    "instructions": "Sit at a preacher bench and grasp an E-Z curl bar with an underhand grip (palms facing up). Your arms should be fully extended and the E-Z curl bar should be just below your shoulders. This will be your starting position. Exhale and slowly curl the barbell up towards your shoulders while keeping your upper arms stationary. Continue to curl until your biceps are fully contracted and the bar is at shoulder level. Hold the contracted position for a brief pause, then inhale and slowly lower the barbell back to the starting position. Repeat for the recommended number of repetitions."
  },
  {
    "name": "Reverse Curl",
    "type": "strength",
    "muscle": "biceps",
    "equipment": "barbell",
    "difficulty": "intermediate",
    "instructions": "Stand up straight with a barbell held at arm's length using a pronated grip (palms facing down), hands shoulder-width apart. Your knees should be slightly bent and your feet should be about shoulder-width apart. This will be your starting position. Keeping your elbows close to your body, exhale and curl the barbell upward until your biceps are fully contracted and the bar is at shoulder level. Hold the contracted position for a brief pause, then inhale and slowly lower the barbell back to the starting position. Repeat for the recommended number of repetitions."
  },
  {
    "name": "Chin-Up",
    "type": "strength",
    "muscle": "biceps",
    "equipment": "bodyweight",
    "difficulty": "advanced",
    "instructions": "Hang from a pull-up bar with your palms facing toward you and your hands shoulder-width apart. Your arms should be fully extended and your legs should be straight with your feet crossed behind you. This will be your starting position. Exhale and pull yourself up until your chin is above the bar, keeping your elbows close to your body and your back straight. Hold the top position for a brief pause, then inhale and lower yourself back down to the starting position. Repeat for the recommended number of repetitions."
  },
  {
    "name": "Hammer Curl",
    "type": "strength",
    "muscle": "biceps",
    "equipment": "dumbbell",
    "difficulty": "beginner",
    "instructions": "Stand up straight with a dumbbell in each hand, palms facing inward toward your body. Your arms should be fully extended and your feet should be shoulder-width apart. This will be your starting position. Exhale and curl the dumbbells upward, keeping your elbows close to your body and your palms facing inward. Continue to curl until your biceps are fully contracted and the dumbbells are at shoulder level. Hold the contracted position for a brief pause, then inhale and slowly lower the dumbbells back to the starting position. Repeat for the recommended number of repetitions."
  },
  {
    "name": "Seated Concentration Curl",
    "type": "strength",
    "muscle": "biceps",
    "equipment": "dumbbell",
    "difficulty": "intermediate",
    "instructions": "Sit on a bench with your legs spread and a dumbbell in one hand, palm facing upward. Rest your elbow on the inside of your thigh, just above your knee, and let the dumbbell hang down toward the floor. This will be your starting position. Exhale and curl the dumbbell upward, keeping your elbow stationary and your palm facing upward. Continue to curl until your biceps are fully contracted and the dumbbell is at shoulder level. Hold the contracted position for a brief pause, then inhale and slowly lower the dumbbell back to the starting position. Repeat for the recommended number of repetitions, then switch arms."
  },
  {
    "name": "Single-Arm Cable Curl",
    "type": "strength",
    "muscle": "biceps",
    "equipment": "cable machine",
    "difficulty": "intermediate",
    "instructions": "Attach a single-hand grip handle to a low pulley cable machine. Stand facing the machine with your feet shoulder-width apart and your knees slightly bent. Grasp the handle with one hand, palm facing upward. Your arm should be fully extended and your elbow should be close to your body. This will be your starting position. Exhale and curl the handle upward, keeping your elbow stationary and your palm facing upward. Continue to curl until your biceps are fully contracted and the handle is at shoulder level. Hold the contracted position for a brief pause, then inhale and slowly lower the handle back to the starting position. Repeat for the recommended number of repetitions, then switch arms."
  },
  {
    "name": "Barbell Squat",
    "type": "strength",
    "muscle": "quadriceps",
    "equipment": "barbell",
    "difficulty": "intermediate",
    "instructions": "Stand with your feet shoulder-width apart and a barbell resting on your upper back. Keep your chest up and your core engaged. Lower your body by bending your knees and pushing your hips back, as if sitting into a chair. Keep your chest up and your knees tracking over your toes. Lower until your thighs are parallel to the ground, then push through your heels to return to the starting position. Repeat for the desired number of repetitions."
  },
  {
    "name": "Romanian Deadlift",
    "type": "strength",
    "muscle": "hamstrings",
    "equipment": "barbell",
    "difficulty": "intermediate",
    "instructions": "Stand with your feet hip-width apart and hold a barbell in front of your thighs, palms facing your body. Keeping your back straight and your core engaged, hinge at your hips to lower the barbell toward the ground while keeping your legs straight but not locked. Lower the barbell until you feel a stretch in your hamstrings, then squeeze your glutes to return to the starting position. Repeat for the desired number of repetitions."
  },
  {
    "name": "Walking Lunges",
    "type": "strength",
    "muscle": "quadriceps",
    "equipment": "bodyweight",
    "difficulty": "beginner",
    "instructions": "Stand with your feet hip-width apart and your hands on your hips. Take a large step forward with your right foot, lowering your body until both knees are bent at 90-degree angles. Your front knee should be directly above your ankle and your back knee should hover just above the ground. Push through your right heel to return to the starting position, then repeat with your left leg. Continue alternating legs as you walk forward. Repeat for the desired distance or number of repetitions."
  },
  {
    "name": "Leg Press",
    "type": "strength",
    "muscle": "quadriceps",
    "equipment": "leg press machine",
    "difficulty": "beginner",
    "instructions": "Sit on the leg press machine with your back flat against the pad and your feet hip-width apart on the platform. Push through your heels to extend your legs and lift the weight, keeping your back flat against the pad and your knees aligned with your toes. Lower the weight slowly until your knees are bent at a 90-degree angle, then push through your heels to return to the starting position. Repeat for the desired number of repetitions."
  },
  {
    "name": "Calf Raise",
    "type": "strength",
    "muscle": "calves",
    "equipment": "dumbbell",
    "difficulty": "beginner",
    "instructions": "Stand with your feet hip-width apart and hold a dumbbell in each hand, palms facing your body. Rise up onto the balls of your feet, lifting your heels as high as possible while keeping your legs straight. Hold the top position for a moment, then lower your heels back to the ground. Repeat for the desired number of repetitions."
  },
  {
    "name": "Bench Press",
    "type": "strength",
    "muscle": "chest",
    "equipment": "barbell",
    "difficulty": "intermediate",
    "instructions": "Lie flat on a bench with your feet planted on the floor and your back arched. Grip the barbell slightly wider than shoulder-width apart, palms facing forward. Lower the barbell to your chest, keeping your elbows at a 45-degree angle to your body. Press the barbell back up to the starting position, fully extending your arms. Repeat for the desired number of repetitions."
  },
  {
    "name": "Push-Up",
    "type": "strength",
    "muscle": "chest",
    "equipment": "bodyweight",
    "difficulty": "beginner",
    "instructions": "Start in a plank position with your hands shoulder-width apart and your body in a straight line from head to heels. Lower your chest toward the ground by bending your elbows, keeping them close to your sides. Push through your palms to return to the starting position. Repeat for the desired number of repetitions."
  },
  {
    "name": "Dumbbell Fly",
    "type": "strength",
    "muscle": "chest",
    "equipment": "dumbbell",
    "difficulty": "intermediate",
    "instructions": "Lie flat on a bench with a dumbbell in each hand, palms facing inward. Extend your arms straight up over your chest, with a slight bend in your elbows. Lower the dumbbells out to the sides in a wide arc, keeping a slight bend in your elbows. When your elbows are in line with your shoulders, reverse the movement and squeeze your chest to bring the dumbbells back to the starting position. Repeat for the desired number of repetitions."
  },
  {
    "name": "Incline Bench Press",
    "type": "strength",
    "muscle": "chest",
    "equipment": "barbell",
    "difficulty": "intermediate",
    "instructions": "Lie on an incline bench set at a 45-degree angle with a barbell racked above your chest. Grip the barbell slightly wider than shoulder-width apart, palms facing forward. Lower the barbell to your chest, keeping your elbows at a 45-degree angle to your body. Press the barbell back up to the starting position, fully extending your arms. Repeat for the desired number of repetitions."
  },
  {
    "name": "Chest Dip",
    "type": "strength",
    "muscle": "chest",
    "equipment": "parallel bars",
    "difficulty": "intermediate",
    "instructions": "Stand between two parallel bars and grip each bar with your palms facing inward. Lift yourself up so your arms are fully extended and your feet are off the ground. Lower your body by bending your elbows, keeping them close to your sides. When your elbows are bent to 90 degrees, press through your palms to return to the starting position. Repeat for the desired number of repetitions."
  },
  {
    "name": "Pull-Up",
    "type": "strength",
    "muscle": "back",
    "equipment": "bodyweight",
    "difficulty": "advanced",
    "instructions": "Hang from a pull-up bar with a wide overhand grip. Pull yourself up until your chin is above the bar, keeping your body straight. Lower yourself back to the starting position. Repeat for the recommended number of repetitions."
  },
  {
    "name": "Bent-Over Row",
    "type": "strength",
    "muscle": "back",
    "equipment": "barbell",
    "difficulty": "intermediate",
    "instructions": "Stand with your feet shoulder-width apart and bend at the waist, keeping your back straight. Hold a barbell with a pronated grip (palms facing down). Pull the barbell to your upper waist, keeping your elbows close to your body. Lower the barbell back to the starting position. Repeat for the recommended number of repetitions."
  },
  {
    "name": "Deadlift",
    "type": "strength",
    "muscle": "back",
    "equipment": "barbell",
    "difficulty": "intermediate",
    "instructions": "Stand with your feet shoulder-width apart and a barbell on the floor in front of you. Bend at your hips and knees to grasp the bar with an overhand grip. Keep your back straight as you lift the bar by extending your hips and knees to stand up straight. Lower the bar back to the floor by bending at your hips and knees. Repeat for the recommended number of repetitions."
  },
  {
    "name": "Running",
    "type": "aerobic",
    "muscle": "full body",
    "equipment": "none",
    "difficulty": "beginner",
    "instructions": "Start with a light jog to warm up. Gradually increase your speed to a comfortable running pace. Keep your body upright, arms bent at 90 degrees, and hands relaxed. Breathe naturally and maintain a steady pace. Run for the desired amount of time or distance."
  },
  {
    "name": "Jump Rope",
    "type": "aerobic",
    "muscle": "full body",
    "equipment": "jump rope",
    "difficulty": "beginner",
    "instructions": "Stand with your feet together and hold the jump rope handles in each hand. Swing the rope over your head and jump as it passes under your feet. Keep your jumps low and your movements quick. Maintain a steady rhythm and pace for the desired amount of time."
  },
  {
    "name": "Cycling",
    "type": "aerobic",
    "muscle": "legs",
    "equipment": "bicycle",
    "difficulty": "beginner",
    "instructions": "Sit on a bicycle with your feet on the pedals. Start pedaling at a comfortable pace. Keep your back straight and hands on the handlebars. Adjust the resistance or gears to match your fitness level. Cycle for the desired amount of time or distance."
  },
  {
    "name": "Swimming",
    "type": "aerobic",
    "muscle": "full body",
    "equipment": "none",
    "difficulty": "beginner",
    "instructions": "Enter the pool and choose a swimming stroke (freestyle, breaststroke, backstroke, or butterfly). Swim at a steady pace, focusing on your technique and breathing. Maintain a consistent effort for the desired amount of time or distance."
  },
  {
    "name": "Rowing",
    "type": "aerobic",
    "muscle": "full body",
    "equipment": "rowing machine",
    "difficulty": "intermediate",
    "instructions": "Sit on the rowing machine with your feet secured in the foot straps. Grab the handle with both hands and extend your legs while pulling the handle towards your chest. Reverse the motion by extending your arms and bending your legs to return to the starting position. Maintain a steady pace and rhythm for the desired amount of time."
  },
  {
    "name": "Elliptical Trainer",
    "type": "aerobic",
    "muscle": "full body",
    "equipment": "elliptical machine",
    "difficulty": "beginner",
    "instructions": "Stand on the elliptical machine with your feet on the pedals and hands on the handles. Start moving the pedals in a smooth, circular motion. Use the handles to engage your upper body. Maintain a steady pace and adjust the resistance as needed. Exercise for the desired amount of time."
  },
  {
    "name": "High-Intensity Interval Training (HIIT)",
    "type": "aerobic",
    "muscle": "full body",
    "equipment": "none",
    "difficulty": "intermediate",
    "instructions": "Choose a set of exercises (e.g., jumping jacks, burpees, sprinting) and perform each at maximum intensity for 20-30 seconds. Follow each exercise with a short rest period of 10-15 seconds. Repeat the circuit for the desired number of rounds or time duration."
  },
  {
    "name": "Step Aerobics",
    "type": "aerobic",
    "muscle": "legs",
    "equipment": "step platform",
    "difficulty": "beginner",
    "instructions": "Place a step platform in front of you. Step up onto the platform with one foot, then the other. Step down in the same order. Maintain a steady pace and keep your movements controlled. Incorporate arm movements or vary the stepping pattern for additional intensity. Continue for the desired amount of time."
  },
  {
    "name": "Dancing",
    "type": "aerobic",
    "muscle": "full body",
    "equipment": "none",
    "difficulty": "beginner",
    "instructions": "Choose a style of dance (e.g., Zumba, hip-hop, salsa) and put on some music. Move your body to the rhythm, incorporating a variety of steps and arm movements. Focus on having fun and keeping your heart rate elevated. Dance for the desired amount of time."
  },
  {
    "name": "Shoulder Press",
    "type": "strength",
    "muscle": "shoulders",
    "equipment": "dumbbell",
    "difficulty": "beginner",
    "instructions": "Sit on a bench with back support and hold a dumbbell in each hand at shoulder height with your palms facing forward. Press the dumbbells upward until your arms are fully extended. Pause at the top, then slowly lower the weights back to the starting position."
  },
  {
    "name": "Lateral Raise",
    "type": "strength",
    "muscle": "shoulders",
    "equipment": "dumbbell",
    "difficulty": "beginner",
    "instructions": "Stand with a dumbbell in each hand at your sides. Keeping your arms straight, lift the dumbbells out to the sides until they reach shoulder height. Pause, then slowly lower them back to the starting position."
  },
  {
    "name": "Front Raise",
    "type": "strength",
    "muscle": "shoulders",
    "equipment": "dumbbell",
    "difficulty": "beginner",
    "instructions": "Stand with a dumbbell in each hand, arms fully extended and palms facing your thighs. Lift the weights in front of you to shoulder height while keeping your arms straight. Pause, then lower the weights back to the starting position."
  },
  {
    "name": "Tricep Dips",
    "type": "strength",
    "muscle": "triceps",
    "equipment": "bench",
    "difficulty": "beginner",
    "instructions": "Sit on a bench and place your hands next to your thighs. Slide your butt off the bench, extending your legs in front of you. Lower your body by bending your elbows until your upper arms are parallel to the ground. Push back up to the starting position."
  },
  {
    "name": "Tricep Pushdown",
    "type": "strength",
    "muscle": "triceps",
    "equipment": "cable machine",
    "difficulty": "beginner",
    "instructions": "Stand facing a cable machine with a rope or bar attachment. Grasp the attachment with an overhand grip. Keeping your elbows close to your sides, push the attachment down until your arms are fully extended. Pause, then slowly return to the starting position."
  },
  {
    "name": "Overhead Tricep Extension",
    "type": "strength",
    "muscle": "triceps",
    "equipment": "dumbbell",
    "difficulty": "beginner",
    "instructions": "Sit or stand with a dumbbell held with both hands above your head. Keep your elbows close to your head, lower the dumbbell behind your head by bending your elbows. Extend your arms to return to the starting position."
  },
  {
    "name": "Plank",
    "type": "strength",
    "muscle": "core",
    "equipment": "none",
    "difficulty": "beginner",
    "instructions": "Start in a push-up position but with your weight on your forearms instead of your hands. Keep your body in a straight line from head to heels. Hold this position for the desired amount of time while keeping your core tight."
  },
  {
    "name": "Russian Twists",
    "type": "strength",
    "muscle": "core",
    "equipment": "medicine ball",
    "difficulty": "beginner",
    "instructions": "Sit on the floor with your knees bent and feet flat. Lean back slightly and hold a medicine ball with both hands in front of your chest. Rotate your torso to the right, then to the left to complete one rep. Continue for the desired number of repetitions."
  },
  {
    "name": "Bicycle Crunches",
    "type": "strength",
    "muscle": "core",
    "equipment": "none",
    "difficulty": "beginner",
    "instructions": "Lie flat on your back with your hands behind your head and legs lifted off the ground. Bring your right elbow and left knee together while extending your right leg. Switch sides, bringing your left elbow and right knee together. Continue alternating sides in a pedaling motion."
  },
  {
    "name": "Leg Raises",
    "type": "strength",
    "muscle": "core",
    "equipment": "none",
    "difficulty": "beginner",
    "instructions": "Lie on your back with your legs straight and hands under your hips. Keeping your legs straight, lift them towards the ceiling until your hips come off the ground. Slowly lower your legs back to the starting position without letting them touch the floor."
  }
]
